#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.commons.azurerm_cosmosdb_sql_container.activations will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "activations" {
        id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/activations"
        name                  = "activations"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/\"_etag\"/?"
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.leases will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "leases" {
        id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/leases"
        name                  = "leases"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/\"_etag\"/?"
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.subscription_history will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "subscription_history" {
        id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/subscription-history"
        name                  = "subscription-history"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/\"_etag\"/?"
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_async_fn_staging_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_async_fn_staging_to_cosmos_db" {
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/c161930d-f412-d5c7-fd1f-6fb80ecfed0b" -> (known after apply)
      ~ name                = "c161930d-f412-d5c7-fd1f-6fb80ecfed0b" -> (known after apply)
      ~ principal_id        = "18e1768e-b88b-41b5-9dcd-d6c679d22c72" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_async_fn_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_async_fn_to_cosmos_db" {
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/2f8f2e69-1f16-9e54-8a10-7c59f26032a6" -> (known after apply)
      ~ name                = "2f8f2e69-1f16-9e54-8a10-7c59f26032a6" -> (known after apply)
      ~ principal_id        = "41e1cda3-650b-4408-afd1-1d85c95121c0" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.commons.azurerm_monitor_autoscale_setting.function_async must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "function_async" {
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Insights/autoScaleSettings/ts-p-itn-sub-async-fn-01-autoscale-01" -> (known after apply)
      ~ name                = "ts-p-itn-sub-async-fn-01-autoscale-01" -> "ts-p-itn-subscription-async-fn-01-autoscale-01" # forces replacement
      - tags                = {} -> null
      ~ target_resource_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-sub-async-fn-01-plan" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ profile {
            name = "default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-sub-async-fn-01-plan" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-sub-async-fn-01-plan" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.commons.azurerm_private_endpoint.subscription_async_fn_staging must be replaced
-/+ resource "azurerm_private_endpoint" "subscription_async_fn_staging" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint" -> (known after apply)
        name                     = "ts-p-itn-subscription-async-fn-staging-endpoint"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-subscription-async-fn-staging-endp.nic.3d644e8c-e68d-4bc9-a95e-cbfabb27b56c"
              - name = "ts-p-itn-subscription-async-fn-staging-endp.nic.3d644e8c-e68d-4bc9-a95e-cbfabb27b56c"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-sub-async-fn-01-staging.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.19",
                        ]
                      - name         = "ts-p-itn-sub-async-fn-01-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-sub-async-fn-01-staging.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.19",
                        ]
                      - name         = "ts-p-itn-sub-async-fn-01-staging.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ts-p-itn-subscription-async-fn-staging-endpoint"
          ~ private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.30.2.19" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.commons.azurerm_role_assignment.subs_asyn_receive_from_evh must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_receive_from_evh" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.EventHub/namespaces/ts-trial-evh/eventhubs/ts-trial-subscription-requests/providers/Microsoft.Authorization/roleAssignments/bffef347-db99-2332-e091-a483843f814f" -> (known after apply)
      ~ name                             = "bffef347-db99-2332-e091-a483843f814f" -> (known after apply)
      ~ principal_id                     = "41e1cda3-650b-4408-afd1-1d85c95121c0" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/a638d3c7-ab3a-418d-83e6-5f17a39d4fde" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_role_assignment.subs_asyn_staging_receive_from_evh must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_staging_receive_from_evh" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.EventHub/namespaces/ts-trial-evh/eventhubs/ts-trial-subscription-requests/providers/Microsoft.Authorization/roleAssignments/87c8b26a-5ff9-ec71-15a9-9d7f99415180" -> (known after apply)
      ~ name                             = "87c8b26a-5ff9-ec71-15a9-9d7f99415180" -> (known after apply)
      ~ principal_id                     = "18e1768e-b88b-41b5-9dcd-d6c679d22c72" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/a638d3c7-ab3a-418d-83e6-5f17a39d4fde" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_app_service_virtual_network_swift_connection.this[0] must be replaced
-/+ resource "azurerm_app_service_virtual_network_swift_connection" "this" {
      ~ app_service_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" # forces replacement -> (known after apply) # forces replacement
      ~ id             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01/config/virtualNetwork" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this must be replaced
-/+ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "ACTIVATION_JOB_TRIGGER"                                         = "on"
          + "ActivationJobCosmosDBConnection__accountEndpoint"               = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          + "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
            # (22 unchanged elements hidden)
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "ts-p-itn-sub-async-fn-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "ts-p-itn-sub-async-fn-01" -> "ts-p-itn-subscription-async-fn-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "4.232.113.40",
          - "4.232.113.41",
          - "4.232.113.42",
          - "4.232.113.43",
          - "4.232.112.61",
          - "4.232.112.152",
          - "4.232.99.2",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "4.232.113.40,4.232.113.41,4.232.113.42,4.232.113.43,4.232.112.61,4.232.112.152,4.232.99.2" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "4.232.112.153",
          - "4.232.112.154",
          - "4.232.112.155",
          - "4.232.112.156",
          - "4.232.112.157",
          - "4.232.112.168",
          - "4.232.112.84",
          - "4.232.112.203",
          - "4.232.112.150",
          - "4.232.112.151",
          - "4.232.112.222",
          - "4.232.113.44",
          - "4.232.113.45",
          - "4.232.112.133",
          - "4.232.112.140",
          - "4.232.112.141",
          - "4.232.112.142",
          - "4.232.14.227",
          - "4.232.113.40",
          - "4.232.113.41",
          - "4.232.113.42",
          - "4.232.113.43",
          - "4.232.112.61",
          - "4.232.112.152",
          - "4.232.112.153",
          - "4.232.112.154",
          - "4.232.112.155",
          - "4.232.112.156",
          - "4.232.112.157",
          - "4.232.112.168",
          - "4.232.112.144",
          - "4.232.112.169",
          - "4.232.112.171",
          - "4.232.112.174",
          - "4.232.113.33",
          - "4.232.113.34",
          - "4.232.99.2",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "4.232.112.153,4.232.112.154,4.232.112.155,4.232.112.156,4.232.112.157,4.232.112.168,4.232.112.84,4.232.112.203,4.232.112.150,4.232.112.151,4.232.112.222,4.232.113.44,4.232.113.45,4.232.112.133,4.232.112.140,4.232.112.141,4.232.112.142,4.232.14.227,4.232.113.40,4.232.113.41,4.232.113.42,4.232.113.43,4.232.112.61,4.232.112.152,4.232.112.153,4.232.112.154,4.232.112.155,4.232.112.156,4.232.112.157,4.232.112.168,4.232.112.144,4.232.112.169,4.232.112.171,4.232.112.174,4.232.113.33,4.232.113.34,4.232.99.2" -> (known after apply)
      ~ service_plan_id                                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-sub-async-fn-01-plan" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      - virtual_network_subnet_id                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-subscription-async-snet-01" -> null
      + zip_deploy_file                                = (known after apply)
        # (16 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "41e1cda3-650b-4408-afd1-1d85c95121c0" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ app_scale_limit                         = 0 -> (known after apply)
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ elastic_instance_minimum                = 0 -> (known after apply)
          ~ linux_fx_version                        = "NODE|20" -> (known after apply)
          + remote_debugging_version                = (known after apply)
          - runtime_scale_monitoring_enabled        = false -> null
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (19 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ sticky_settings {
          - connection_string_names = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.commons.module.subscription_async_fn.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Insights/metricAlerts/[ts-trial | ts-p-itn-sub-async-fn-01] Health Check Failed" -> (known after apply)
      ~ name                     = "[ts-trial | ts-p-itn-sub-async-fn-01] Health Check Failed" -> "[ts-trial | ts-p-itn-subscription-async-fn-01] Health Check Failed" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01",
        ] -> (known after apply)
      - tags                     = {} -> null
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

        # (1 unchanged block hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-sub-async-fn-01-plan" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "ts-p-itn-sub-async-fn-01-plan" -> "ts-p-itn-subscription-async-fn-01-plan" # forces replacement
      ~ reserved                     = true -> (known after apply)
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (6 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_app_service_slot_virtual_network_swift_connection.this[0] must be replaced
-/+ resource "azurerm_app_service_slot_virtual_network_swift_connection" "this" {
      ~ app_service_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" # forces replacement -> (known after apply) # forces replacement
      ~ id             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01/slots/staging/config/virtualNetwork" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this must be replaced
-/+ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "ACTIVATION_JOB_TRIGGER"                                         = "on"
          + "ActivationJobCosmosDBConnection__accountEndpoint"               = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          + "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
            # (22 unchanged elements hidden)
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "ts-p-itn-sub-async-fn-01-staging.azurewebsites.net" -> (known after apply)
      ~ function_app_id                                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01" # forces replacement -> (known after apply) # forces replacement
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-sub-async-fn-01/slots/staging" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
        name                                           = "staging"
      ~ outbound_ip_address_list                       = [] -> (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      ~ possible_outbound_ip_address_list              = [] -> (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      - virtual_network_subnet_id                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-subscription-async-snet-01" -> null
        # (14 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "18e1768e-b88b-41b5-9dcd-d6c679d22c72" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ app_scale_limit                         = 0 -> (known after apply)
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ elastic_instance_minimum                = 0 -> (known after apply)
          ~ linux_fx_version                        = "NODE|20" -> (known after apply)
          + remote_debugging_version                = (known after apply)
          - runtime_scale_monitoring_enabled        = false -> null
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (19 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "ACTIVATION_JOB_TRIGGER"                          = "off"
          + "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
            # (21 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "ACTIVATION_JOB_TRIGGER"                          = "off"
          + "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
            # (21 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 5 to change, 12 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
